<a href="https://colab.research.google.com/github/Nub-T/Simple_Production/blob/main/RandomForests_Prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<i>Predict the Survival Passengers</i><br>
--
Created by : Yehezk34

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
train_data = pd.read_csv("https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/train.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1606751804&Signature=AdNDlZRri6Mgvlu7%2FskTVBEIqcWTdOKrrpPXVqeg3yzn1rgxIm5%2FvqhZ6Bpau8s8oQfosJ%2BdlxXbx58P8uicPA5d3tm3BQ%2F%2Fio%2BA0qWiu1lqwerLF1aNtxqWa43f2WUgIjyfsaFheKBBINLwrH4gl6Jo6cQxzMJ90BK2y%2BNe2CFS7eiEgTIMPLGbhyEknYvf%2BmVIZmr5bnNg3TcB1g1PwWJDmTRwho4sj3XrTmqk9ytmmbZ4pYpm3EdhI%2BlR6qXLDkpmRQlmoA%2FRARboLr28OlRrCOztvwpDnekHc2ANOAWT%2BCuVVTANxZB56i5VEZHbZSyMdbtjT1BQuwbIF8BPCg%3D%3D&response-content-disposition=attachment%3B+filename%3Dtrain.csv")
test_data = pd.read_csv("https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/test.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1606751798&Signature=ngcl4QL8t22cdCzLMD6ZvXF3sH0eL8d46UTU72u34v5nD7GavPh4Ou2T2S9C%2BNElfX%2F7Yywrc8JdN8Qq0V4qHt7I7kLnacWZtA1Ke9dSGyLwaY6o%2BHNCUj5f4iCrYhmTYbyPjb9xzaXL34rHY%2BsSVUVGgHCzWCIUuQouvFe9I1kCdEnkDDKP6RqM29nf5FjdZXlnyHgG6foi32gutcyz4eBsrH3nTrXjZaV%2BjRKWy6lOAE%2FTSdILS0kMXZcOVQPDmmrm9Eo2MaN89UWQc%2FRXvYS5bNNJIkEFXBQzVytDGTlERAhKEtfcMF2TY%2FE6AEqaMVV25fQP9S%2Bruj3pOXr0tg%3D%3D&response-content-disposition=attachment%3B+filename%3Dtest.csv")

In [5]:
print(train_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [7]:
print(train_data.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
train_data.drop('Cabin', axis=1, inplace=True)

train_data["Embarked"].fillna(train_data['Embarked'].value_counts().idxmax(), inplace=True)
train_data["Age"].fillna(train_data["Age"].median(skipna=True), inplace=True)

train_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [12]:
print(train_data.head(10))

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S
5            6         0       3  ...            330877   8.4583         Q
6            7         0       1  ...             17463  51.8625         S
7            8         0       3  ...            349909  21.0750         S
8            9         1       3  ...            347742  11.1333         S
9           10         1       2  ...            237736  30.0708         C

[10 rows x 11 columns]

In [13]:
# Encoding the sex values.
train_data['Sex'].replace("female", 0,inplace=True)
train_data['Sex'].replace("male", 1,inplace=True)

# Encoding the embarked values.
train_data['Embarked'].replace("S", 0,inplace=True)
train_data['Embarked'].replace("C", 1,inplace=True)
train_data['Embarked'].replace("Q", 2,inplace=True)

# Now we look at the dtypes!
train_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked         int64
dtype: object

In [14]:
# Check the null sum!
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [15]:
test_data["Age"].fillna(test_data["Age"].median(skipna=True), inplace=True)
test_data["Fare"].fillna(test_data["Fare"].median(skipna=True), inplace=True)
test_data.drop('Cabin', axis=1, inplace=True)

test_data['Sex'].replace("female", 0,inplace=True)
test_data['Sex'].replace("male", 1,inplace=True)

test_data['Embarked'].replace("S", 0,inplace=True)
test_data['Embarked'].replace("C", 1,inplace=True)
test_data['Embarked'].replace("Q", 2,inplace=True)

In [16]:
# Check the dtypes again!
test_data.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked         int64
dtype: object

In [19]:
print(train_data.shape)
print(test_data.shape)

(891, 11)
(418, 10)

In [20]:
train_data.head(10)

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         0
1            2         1       1  ...          PC 17599  71.2833         1
2            3         1       3  ...  STON/O2. 3101282   7.9250         0
3            4         1       1  ...            113803  53.1000         0
4            5         0       3  ...            373450   8.0500         0
5            6         0       3  ...            330877   8.4583         2
6            7         0       1  ...             17463  51.8625         0
7            8         0       3  ...            349909  21.0750         0
8            9         1       3  ...            347742  11.1333         0
9           10         1       2  ...            237736  30.0708         1

[10 rows x 11 columns]

In [21]:
outcome_data = train_data["Survived"]
train_data.drop(["Survived", "Ticket", "Name", "PassengerId"], axis=1, inplace=True)
test_data.drop(["Name","PassengerId","Ticket"], axis=1, inplace=True)

In [22]:
# Random Forest!
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
from sklearn.model_selection import cross_val_score
from sklearn.metrics import accuracy_score, roc_auc_score, confusion_matrix, classification_report

In [23]:
X = train_data.values
y = outcome_data.values
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1, stratify=y)

In [26]:
classifier = SVC(kernel = 'linear', random_state = 0)
classifier.fit(X_train, y_train)

y_pred = classifier.predict(X_test)
y_pred_train = classifier.predict(X_train)

print("Accuracy Train: ", accuracy_score(y_train, y_pred_train))
print("Accuracy Test: ", accuracy_score(y_test, y_pred))
print("\nConfusion Matrix\n")
print(confusion_matrix(y_test, y_pred))

Accuracy Train:  0.7907303370786517
Accuracy Test:  0.7988826815642458

Confusion Matrix

[[94 16]
 [20 49]]

In [27]:
last_clf = SVC(kernel = 'linear', random_state = 0)
last_clf.fit(train_data, outcome_data)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='linear',
    max_iter=-1, probability=False, random_state=0, shrinking=True, tol=0.001,
    verbose=False)

In [29]:
ids = pd.read_csv("https://storage.googleapis.com/kagglesdsdata/competitions/3136/26502/test.csv?GoogleAccessId=web-data@kaggle-161607.iam.gserviceaccount.com&Expires=1606751798&Signature=ngcl4QL8t22cdCzLMD6ZvXF3sH0eL8d46UTU72u34v5nD7GavPh4Ou2T2S9C%2BNElfX%2F7Yywrc8JdN8Qq0V4qHt7I7kLnacWZtA1Ke9dSGyLwaY6o%2BHNCUj5f4iCrYhmTYbyPjb9xzaXL34rHY%2BsSVUVGgHCzWCIUuQouvFe9I1kCdEnkDDKP6RqM29nf5FjdZXlnyHgG6foi32gutcyz4eBsrH3nTrXjZaV%2BjRKWy6lOAE%2FTSdILS0kMXZcOVQPDmmrm9Eo2MaN89UWQc%2FRXvYS5bNNJIkEFXBQzVytDGTlERAhKEtfcMF2TY%2FE6AEqaMVV25fQP9S%2Bruj3pOXr0tg%3D%3D&response-content-disposition=attachment%3B+filename%3Dtest.csv")[["PassengerId"]].values
predictions = last_clf.predict(test_data.values)

print(predictions)
df = {'PassengerId': ids.ravel(), 'Survived':predictions}
Result = pd.DataFrame(df)
display(Result.head(10))
Result.to_csv("Result.csv", index=False)

[0 1 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 1 1 0 0 1 0 1 0 1 0 0 0 0 0 1 1 0 0 1
 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 1 1 0 1 0
 1 0 0 1 0 1 0 0 0 0 0 0 1 1 1 0 1 0 1 0 0 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 0 1 1 0 1 0 0 1 0 1 0 0 0 0 1 0 0 0 0 0 1 0 1 1 0 0 0 0 0 0
 0 0 1 0 0 1 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 1 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1
 0 1 0 1 0 0 0 0 0 0 0 0 1 0 1 1 0 0 1 0 0 1 0 1 0 0 0 0 1 1 0 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 1 0 1 1 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 1 0 0 0 1 1 0 1 0 0 0 0 1 0 1 1 1 0 0 0 0 0 0 1 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 0 0 0 1 0 0 0 1 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 1 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 0 1 1 0
 0 1 0 0 1 1 1 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 0 1 1 1 1 1 0 1 0 0 0]

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0
6          898         1
7          899         0
8          900         1
9          901         0